app/controllers/information_controller.rb

  def index
    @information = Information.all
---
SELECT "information".* FROM "information"

  def create
    @information = Information.new(information_params)

    if @information.save
---
INSERT INTO "information" ("title", "image", "description", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"